Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1025dab176.h
#define _SRCON1G_SR1G12_POSITION                 0x0000000C
#define _SRCON1G_SR1G12_MASK                     0x00001000
#define _SRCON1G_SR1G12_LENGTH                   0x00000001

#define _SRCON1G_SR1G13_POSITION                 0x0000000D
#define _SRCON1G_SR1G13_MASK                     0x00002000
#define _SRCON1G_SR1G13_LENGTH                   0x00000001

#define _SRCON1G_SR1G14_POSITION                 0x0000000E
#define _SRCON1G_SR1G14_MASK                     0x00004000
#define _SRCON1G_SR1G14_LENGTH                   0x00000001

#define _SRCON1G_SR1G15_POSITION                 0x0000000F
#define _SRCON1G_SR1G15_MASK                     0x00008000
#define _SRCON1G_SR1G15_LENGTH                   0x00000001

#define _ANSELH_ANSH3_POSITION                   0x00000003
#define _ANSELH_ANSH3_MASK                       0x00000008
#define _ANSELH_ANSH3_LENGTH                     0x00000001

#define _ANSELH_ANSH4_POSITION                   0x00000004
#define _ANSELH_ANSH4_MASK                       0x00000010
#define _ANSELH_ANSH4_LENGTH                     0x00000001

#define _ANSELH_ANSH7_POSITION                   0x00000007
#define _ANSELH_ANSH7_MASK                       0x00000080
#define _ANSELH_ANSH7_LENGTH                     0x00000001

#define _ANSELH_ANSH11_POSITION                  0x0000000B
#define _ANSELH_ANSH11_MASK                      0x00000800
#define _ANSELH_ANSH11_LENGTH                    0x00000001

#define _ANSELH_w_POSITION                       0x00000000
#define _ANSELH_w_MASK                           0xFFFFFFFF
#define _ANSELH_w_LENGTH                         0x00000020

#define _TRISH_TRISH0_POSITION                   0x00000000
#define _TRISH_TRISH0_MASK                       0x00000001
#define _TRISH_TRISH0_LENGTH                     0x00000001

#define _TRISH_TRISH1_POSITION                   0x00000001
#define _TRISH_TRISH1_MASK                       0x00000002
#define _TRISH_TRISH1_LENGTH                     0x00000001

#define _TRISH_TRISH2_POSITION                   0x00000002
#define _TRISH_TRISH2_MASK                       0x00000004
#define _TRISH_TRISH2_LENGTH                     0x00000001

#define _TRISH_TRISH3_POSITION                   0x00000003
#define _TRISH_TRISH3_MASK                       0x00000008
#define _TRISH_TRISH3_LENGTH                     0x00000001

#define _TRISH_TRISH4_POSITION                   0x00000004
#define _TRISH_TRISH4_MASK                       0x00000010
#define _TRISH_TRISH4_LENGTH                     0x00000001

#define _TRISH_TRISH5_POSITION                   0x00000005
#define _TRISH_TRISH5_MASK                       0x00000020
#define _TRISH_TRISH5_LENGTH                     0x00000001

#define _TRISH_TRISH6_POSITION                   0x00000006
#define _TRISH_TRISH6_MASK                       0x00000040
#define _TRISH_TRISH6_LENGTH                     0x00000001

#define _TRISH_TRISH7_POSITION                   0x00000007
#define _TRISH_TRISH7_MASK                       0x00000080
#define _TRISH_TRISH7_LENGTH                     0x00000001

#define _TRISH_TRISH8_POSITION                   0x00000008
#define _TRISH_TRISH8_MASK                       0x00000100
#define _TRISH_TRISH8_LENGTH                     0x00000001

#define _TRISH_TRISH9_POSITION                   0x00000009
#define _TRISH_TRISH9_MASK                       0x00000200
#define _TRISH_TRISH9_LENGTH                     0x00000001

#define _TRISH_TRISH10_POSITION                  0x0000000A
#define _TRISH_TRISH10_MASK                      0x00000400
#define _TRISH_TRISH10_LENGTH                    0x00000001

#define _TRISH_TRISH11_POSITION                  0x0000000B
#define _TRISH_TRISH11_MASK                      0x00000800
#define _TRISH_TRISH11_LENGTH                    0x00000001

#define _TRISH_TRISH12_POSITION                  0x0000000C
#define _TRISH_TRISH12_MASK                      0x00001000
#define _TRISH_TRISH12_LENGTH                    0x00000001

#define _TRISH_TRISH13_POSITION                  0x0000000D
#define _TRISH_TRISH13_MASK                      0x00002000
#define _TRISH_TRISH13_LENGTH                    0x00000001

#define _TRISH_TRISH14_POSITION                  0x0000000E
#define _TRISH_TRISH14_MASK                      0x00004000
#define _TRISH_TRISH14_LENGTH                    0x00000001

#define _TRISH_TRISH15_POSITION                  0x0000000F
#define _TRISH_TRISH15_MASK                      0x00008000
#define _TRISH_TRISH15_LENGTH                    0x00000001

#define _TRISH_w_POSITION                        0x00000000
#define _TRISH_w_MASK                            0xFFFFFFFF
#define _TRISH_w_LENGTH                          0x00000020

#define _PORTH_RH0_POSITION                      0x00000000
#define _PORTH_RH0_MASK                          0x00000001
#define _PORTH_RH0_LENGTH                        0x00000001

#define _PORTH_RH1_POSITION                      0x00000001
#define _PORTH_RH1_MASK                          0x00000002
#define _PORTH_RH1_LENGTH                        0x00000001

#define _PORTH_RH2_POSITION                      0x00000002
#define _PORTH_RH2_MASK                          0x00000004
#define _PORTH_RH2_LENGTH                        0x00000001

#define _PORTH_RH3_POSITION                      0x00000003
#define _PORTH_RH3_MASK                          0x00000008
#define _PORTH_RH3_LENGTH                        0x00000001

#define _PORTH_RH4_POSITION                      0x00000004
#define _PORTH_RH4_MASK                          0x00000010
#define _PORTH_RH4_LENGTH                        0x00000001

#define _PORTH_RH5_POSITION                      0x00000005
#define _PORTH_RH5_MASK                          0x00000020
#define _PORTH_RH5_LENGTH                        0x00000001

#define _PORTH_RH6_POSITION                      0x00000006
#define _PORTH_RH6_MASK                          0x00000040
#define _PORTH_RH6_LENGTH                        0x00000001

#define _PORTH_RH7_POSITION                      0x00000007
#define _PORTH_RH7_MASK                          0x00000080
#define _PORTH_RH7_LENGTH                        0x00000001

#define _PORTH_RH8_POSITION                      0x00000008
#define _PORTH_RH8_MASK                          0x00000100
#define _PORTH_RH8_LENGTH                        0x00000001

#define _PORTH_RH9_POSITION                      0x00000009
#define _PORTH_RH9_MASK                          0x00000200
#define _PORTH_RH9_LENGTH                        0x00000001

#define _PORTH_RH10_POSITION                     0x0000000A
#define _PORTH_RH10_MASK                         0x00000400
#define _PORTH_RH10_LENGTH                       0x00000001

#define _PORTH_RH11_POSITION                     0x0000000B
#define _PORTH_RH11_MASK                         0x00000800
#define _PORTH_RH11_LENGTH                       0x00000001

#define _PORTH_RH12_POSITION                     0x0000000C
#define _PORTH_RH12_MASK                         0x00001000
#define _PORTH_RH12_LENGTH                       0x00000001

#define _PORTH_RH13_POSITION                     0x0000000D
#define _PORTH_RH13_MASK                         0x00002000
#define _PORTH_RH13_LENGTH                       0x00000001

#define _PORTH_RH14_POSITION                     0x0000000E
#define _PORTH_RH14_MASK                         0x00004000
#define _PORTH_RH14_LENGTH                       0x00000001

#define _PORTH_RH15_POSITION                     0x0000000F
#define _PORTH_RH15_MASK                         0x00008000
#define _PORTH_RH15_LENGTH                       0x00000001

