Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1025dab176.h
#define _GLCDCLUT173_BLUE_POSITION               0x00000000
#define _GLCDCLUT173_BLUE_MASK                   0x000000FF
#define _GLCDCLUT173_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT173_GREEN_POSITION              0x00000008
#define _GLCDCLUT173_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT173_GREEN_LENGTH                0x00000008

#define _GLCDCLUT173_RED_POSITION                0x00000010
#define _GLCDCLUT173_RED_MASK                    0x00FF0000
#define _GLCDCLUT173_RED_LENGTH                  0x00000008

#define _GLCDCLUT174_BLUE_POSITION               0x00000000
#define _GLCDCLUT174_BLUE_MASK                   0x000000FF
#define _GLCDCLUT174_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT174_GREEN_POSITION              0x00000008
#define _GLCDCLUT174_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT174_GREEN_LENGTH                0x00000008

#define _GLCDCLUT174_RED_POSITION                0x00000010
#define _GLCDCLUT174_RED_MASK                    0x00FF0000
#define _GLCDCLUT174_RED_LENGTH                  0x00000008

#define _GLCDCLUT175_BLUE_POSITION               0x00000000
#define _GLCDCLUT175_BLUE_MASK                   0x000000FF
#define _GLCDCLUT175_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT175_GREEN_POSITION              0x00000008
#define _GLCDCLUT175_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT175_GREEN_LENGTH                0x00000008

#define _GLCDCLUT175_RED_POSITION                0x00000010
#define _GLCDCLUT175_RED_MASK                    0x00FF0000
#define _GLCDCLUT175_RED_LENGTH                  0x00000008

#define _GLCDCLUT176_BLUE_POSITION               0x00000000
#define _GLCDCLUT176_BLUE_MASK                   0x000000FF
#define _GLCDCLUT176_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT176_GREEN_POSITION              0x00000008
#define _GLCDCLUT176_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT176_GREEN_LENGTH                0x00000008

#define _GLCDCLUT176_RED_POSITION                0x00000010
#define _GLCDCLUT176_RED_MASK                    0x00FF0000
#define _GLCDCLUT176_RED_LENGTH                  0x00000008

#define _GLCDCLUT177_BLUE_POSITION               0x00000000
#define _GLCDCLUT177_BLUE_MASK                   0x000000FF
#define _GLCDCLUT177_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT177_GREEN_POSITION              0x00000008
#define _GLCDCLUT177_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT177_GREEN_LENGTH                0x00000008

#define _GLCDCLUT177_RED_POSITION                0x00000010
#define _GLCDCLUT177_RED_MASK                    0x00FF0000
#define _GLCDCLUT177_RED_LENGTH                  0x00000008

#define _GLCDCLUT178_BLUE_POSITION               0x00000000
#define _GLCDCLUT178_BLUE_MASK                   0x000000FF
#define _GLCDCLUT178_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT178_GREEN_POSITION              0x00000008
#define _GLCDCLUT178_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT178_GREEN_LENGTH                0x00000008

#define _GLCDCLUT178_RED_POSITION                0x00000010
#define _GLCDCLUT178_RED_MASK                    0x00FF0000
#define _GLCDCLUT178_RED_LENGTH                  0x00000008

#define _GLCDCLUT179_BLUE_POSITION               0x00000000
#define _GLCDCLUT179_BLUE_MASK                   0x000000FF
#define _GLCDCLUT179_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT179_GREEN_POSITION              0x00000008
#define _GLCDCLUT179_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT179_GREEN_LENGTH                0x00000008

#define _GLCDCLUT179_RED_POSITION                0x00000010
#define _GLCDCLUT179_RED_MASK                    0x00FF0000
#define _GLCDCLUT179_RED_LENGTH                  0x00000008

#define _GLCDCLUT180_BLUE_POSITION               0x00000000
#define _GLCDCLUT180_BLUE_MASK                   0x000000FF
#define _GLCDCLUT180_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT180_GREEN_POSITION              0x00000008
#define _GLCDCLUT180_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT180_GREEN_LENGTH                0x00000008

#define _GLCDCLUT180_RED_POSITION                0x00000010
#define _GLCDCLUT180_RED_MASK                    0x00FF0000
#define _GLCDCLUT180_RED_LENGTH                  0x00000008

#define _GLCDCLUT181_BLUE_POSITION               0x00000000
#define _GLCDCLUT181_BLUE_MASK                   0x000000FF
#define _GLCDCLUT181_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT181_GREEN_POSITION              0x00000008
#define _GLCDCLUT181_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT181_GREEN_LENGTH                0x00000008

#define _GLCDCLUT181_RED_POSITION                0x00000010
#define _GLCDCLUT181_RED_MASK                    0x00FF0000
#define _GLCDCLUT181_RED_LENGTH                  0x00000008

#define _GLCDCLUT182_BLUE_POSITION               0x00000000
#define _GLCDCLUT182_BLUE_MASK                   0x000000FF
#define _GLCDCLUT182_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT182_GREEN_POSITION              0x00000008
#define _GLCDCLUT182_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT182_GREEN_LENGTH                0x00000008

#define _GLCDCLUT182_RED_POSITION                0x00000010
#define _GLCDCLUT182_RED_MASK                    0x00FF0000
#define _GLCDCLUT182_RED_LENGTH                  0x00000008

#define _GLCDCLUT183_BLUE_POSITION               0x00000000
#define _GLCDCLUT183_BLUE_MASK                   0x000000FF
#define _GLCDCLUT183_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT183_GREEN_POSITION              0x00000008
#define _GLCDCLUT183_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT183_GREEN_LENGTH                0x00000008

#define _GLCDCLUT183_RED_POSITION                0x00000010
#define _GLCDCLUT183_RED_MASK                    0x00FF0000
#define _GLCDCLUT183_RED_LENGTH                  0x00000008

#define _GLCDCLUT184_BLUE_POSITION               0x00000000
#define _GLCDCLUT184_BLUE_MASK                   0x000000FF
#define _GLCDCLUT184_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT184_GREEN_POSITION              0x00000008
#define _GLCDCLUT184_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT184_GREEN_LENGTH                0x00000008

#define _GLCDCLUT184_RED_POSITION                0x00000010
#define _GLCDCLUT184_RED_MASK                    0x00FF0000
#define _GLCDCLUT184_RED_LENGTH                  0x00000008

